Highlighted elements are joined but do not intersect.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId JoiningDisjoint { get; }
  Visual Basic
Public Shared ReadOnly Property JoiningDisjoint As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ JoiningDisjoint {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures JoinElementsFailures Class
  Autodesk.Revit.DB Namespace